grevaillot/svd_tools/headers/STM32H7B3x/rcc.h
/** @defgroup rcc_apb2rstr APB2RSTR RCC APB2 Peripheral Reset Register
@{*/

/** RCC_APB2RSTR_HRTIMRST HRTIM block reset **/
#define RCC_APB2RSTR_HRTIMRST		(1 << 29)
/** RCC_APB2RSTR_DFSDM1RST DFSDM1 block reset **/
#define RCC_APB2RSTR_DFSDM1RST		(1 << 28)
/** RCC_APB2RSTR_SAI3RST SAI3 block reset **/
#define RCC_APB2RSTR_SAI3RST		(1 << 24)
/** RCC_APB2RSTR_SAI2RST SAI2 block reset **/
#define RCC_APB2RSTR_SAI2RST		(1 << 23)
/** RCC_APB2RSTR_SAI1RST SAI1 block reset **/
#define RCC_APB2RSTR_SAI1RST		(1 << 22)
/** RCC_APB2RSTR_SPI5RST SPI5 block reset **/
#define RCC_APB2RSTR_SPI5RST		(1 << 20)
/** RCC_APB2RSTR_TIM17RST TIM17 block reset **/
#define RCC_APB2RSTR_TIM17RST		(1 << 18)
/** RCC_APB2RSTR_TIM16RST TIM16 block reset **/
#define RCC_APB2RSTR_TIM16RST		(1 << 17)
/** RCC_APB2RSTR_TIM15RST TIM15 block reset **/
#define RCC_APB2RSTR_TIM15RST		(1 << 16)
/** RCC_APB2RSTR_SPI4RST SPI4 block reset **/
#define RCC_APB2RSTR_SPI4RST		(1 << 13)
/** RCC_APB2RSTR_SPI1RST SPI1 block reset **/
#define RCC_APB2RSTR_SPI1RST		(1 << 12)
/** RCC_APB2RSTR_USART6RST USART6 block reset **/
#define RCC_APB2RSTR_USART6RST		(1 << 5)
/** RCC_APB2RSTR_USART1RST USART1 block reset **/
#define RCC_APB2RSTR_USART1RST		(1 << 4)
/** RCC_APB2RSTR_TIM8RST TIM8 block reset **/
#define RCC_APB2RSTR_TIM8RST		(1 << 1)
/** RCC_APB2RSTR_TIM1RST TIM1 block reset **/
#define RCC_APB2RSTR_TIM1RST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb4rstr APB4RSTR RCC APB4 Peripheral Reset Register
@{*/

/** RCC_APB4RSTR_SAI4RST SAI4 block reset **/
#define RCC_APB4RSTR_SAI4RST		(1 << 21)
/** RCC_APB4RSTR_VREFRST VREF block reset **/
#define RCC_APB4RSTR_VREFRST		(1 << 15)
/** RCC_APB4RSTR_COMP12RST COMP12 Blocks Reset **/
#define RCC_APB4RSTR_COMP12RST		(1 << 14)
/** RCC_APB4RSTR_LPTIM5RST LPTIM5 block reset **/
#define RCC_APB4RSTR_LPTIM5RST		(1 << 12)
/** RCC_APB4RSTR_LPTIM4RST LPTIM4 block reset **/
#define RCC_APB4RSTR_LPTIM4RST		(1 << 11)
/** RCC_APB4RSTR_LPTIM3RST LPTIM3 block reset **/
#define RCC_APB4RSTR_LPTIM3RST		(1 << 10)
/** RCC_APB4RSTR_LPTIM2RST LPTIM2 block reset **/
#define RCC_APB4RSTR_LPTIM2RST		(1 << 9)
/** RCC_APB4RSTR_I2C4RST I2C4 block reset **/
#define RCC_APB4RSTR_I2C4RST		(1 << 7)
/** RCC_APB4RSTR_SPI6RST SPI6 block reset **/
#define RCC_APB4RSTR_SPI6RST		(1 << 5)
/** RCC_APB4RSTR_LPUART1RST LPUART1 block reset **/
#define RCC_APB4RSTR_LPUART1RST		(1 << 3)
/** RCC_APB4RSTR_SYSCFGRST SYSCFG block reset **/
#define RCC_APB4RSTR_SYSCFGRST		(1 << 1)

/**@}*/

/** @defgroup rcc_d3amr D3AMR RCC D3 Autonomous mode Register
@{*/

/** RCC_D3AMR_SRAM4AMEN SRAM4 Autonomous mode enable **/
#define RCC_D3AMR_SRAM4AMEN		(1 << 29)
/** RCC_D3AMR_BKPSRAMAMEN Backup RAM Autonomous mode enable **/
#define RCC_D3AMR_BKPSRAMAMEN		(1 << 28)
/** RCC_D3AMR_ADC3AMEN ADC3 Autonomous mode enable **/
#define RCC_D3AMR_ADC3AMEN		(1 << 24)
/** RCC_D3AMR_SAI4AMEN SAI4 Autonomous mode enable **/
#define RCC_D3AMR_SAI4AMEN		(1 << 21)
/** RCC_D3AMR_CRCAMEN CRC Autonomous mode enable **/
#define RCC_D3AMR_CRCAMEN		(1 << 19)
/** RCC_D3AMR_RTCAMEN RTC Autonomous mode enable **/
#define RCC_D3AMR_RTCAMEN		(1 << 16)
/** RCC_D3AMR_VREFAMEN VREF Autonomous mode enable **/
#define RCC_D3AMR_VREFAMEN		(1 << 15)
/** RCC_D3AMR_COMP12AMEN COMP12 Autonomous mode enable **/
#define RCC_D3AMR_COMP12AMEN		(1 << 14)
/** RCC_D3AMR_LPTIM5AMEN LPTIM5 Autonomous mode enable **/
#define RCC_D3AMR_LPTIM5AMEN		(1 << 12)
/** RCC_D3AMR_LPTIM4AMEN LPTIM4 Autonomous mode enable **/
#define RCC_D3AMR_LPTIM4AMEN		(1 << 11)
/** RCC_D3AMR_LPTIM3AMEN LPTIM3 Autonomous mode enable **/
#define RCC_D3AMR_LPTIM3AMEN		(1 << 10)
/** RCC_D3AMR_LPTIM2AMEN LPTIM2 Autonomous mode enable **/
#define RCC_D3AMR_LPTIM2AMEN		(1 << 9)
/** RCC_D3AMR_I2C4AMEN I2C4 Autonomous mode enable **/
#define RCC_D3AMR_I2C4AMEN		(1 << 7)
/** RCC_D3AMR_SPI6AMEN SPI6 Autonomous mode enable **/
#define RCC_D3AMR_SPI6AMEN		(1 << 5)
/** RCC_D3AMR_LPUART1AMEN LPUART1 Autonomous mode enable **/
#define RCC_D3AMR_LPUART1AMEN		(1 << 3)
/** RCC_D3AMR_BDMAAMEN BDMA and DMAMUX Autonomous mode enable **/
#define RCC_D3AMR_BDMAAMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_rsr C1RSR RCC Reset Status Register
@{*/

/** RCC_C1_RSR_LPWRRSTF Reset due to illegal D1 DStandby or CPU CStop flag **/
#define RCC_C1_RSR_LPWRRSTF		(1 << 30)
/** RCC_C1_RSR_WWDG1RSTF Window Watchdog reset flag **/
#define RCC_C1_RSR_WWDG1RSTF		(1 << 28)
/** RCC_C1_RSR_IWDG1RSTF Independent Watchdog reset flag **/
#define RCC_C1_RSR_IWDG1RSTF		(1 << 26)
/** RCC_C1_RSR_SFTRSTF System reset from CPU reset flag **/
#define RCC_C1_RSR_SFTRSTF		(1 << 24)
/** RCC_C1_RSR_PORRSTF POR/PDR reset flag **/
#define RCC_C1_RSR_PORRSTF		(1 << 23)
/** RCC_C1_RSR_PINRSTF Pin reset flag (NRST) **/
#define RCC_C1_RSR_PINRSTF		(1 << 22)
/** RCC_C1_RSR_BORRSTF BOR reset flag **/
#define RCC_C1_RSR_BORRSTF		(1 << 21)
/** RCC_C1_RSR_D2RSTF D2 domain power switch reset flag **/
#define RCC_C1_RSR_D2RSTF		(1 << 20)
/** RCC_C1_RSR_D1RSTF D1 domain power switch reset flag **/
#define RCC_C1_RSR_D1RSTF		(1 << 19)
/** RCC_C1_RSR_CPURSTF CPU reset flag **/
#define RCC_C1_RSR_CPURSTF		(1 << 17)
/** RCC_C1_RSR_RMVF Remove reset flag **/
#define RCC_C1_RSR_RMVF		(1 << 16)

/**@}*/

/** @defgroup rcc_c1_ahb3enr C1AHB3ENR RCC AHB3 Clock Register
@{*/

/** RCC_C1_AHB3ENR_SDMMC1EN SDMMC1 and SDMMC1 Delay Clock Enable **/
#define RCC_C1_AHB3ENR_SDMMC1EN		(1 << 16)
/** RCC_C1_AHB3ENR_QSPIEN QUADSPI and QUADSPI Delay Clock Enable **/
#define RCC_C1_AHB3ENR_QSPIEN		(1 << 14)
/** RCC_C1_AHB3ENR_FMCEN FMC Peripheral Clocks Enable **/
#define RCC_C1_AHB3ENR_FMCEN		(1 << 12)
/** RCC_C1_AHB3ENR_JPGDECEN JPGDEC Peripheral Clock Enable **/
#define RCC_C1_AHB3ENR_JPGDECEN		(1 << 5)
/** RCC_C1_AHB3ENR_DMA2DEN DMA2D Peripheral Clock Enable **/
#define RCC_C1_AHB3ENR_DMA2DEN		(1 << 4)
/** RCC_C1_AHB3ENR_MDMAEN MDMA Peripheral Clock Enable **/
#define RCC_C1_AHB3ENR_MDMAEN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_ahb1enr C1AHB1ENR RCC AHB1 Clock Register
@{*/

/** RCC_C1_AHB1ENR_USB2ULPIEN USB_PHY2 Clocks Enable **/
#define RCC_C1_AHB1ENR_USB2ULPIEN		(1 << 28)
/** RCC_C1_AHB1ENR_USB2OTGEN USB2OTG Peripheral Clocks Enable **/
#define RCC_C1_AHB1ENR_USB2OTGEN		(1 << 27)
/** RCC_C1_AHB1ENR_USB1ULPIEN USB_PHY1 Clocks Enable **/
#define RCC_C1_AHB1ENR_USB1ULPIEN		(1 << 26)
/** RCC_C1_AHB1ENR_USB1OTGEN USB1OTG Peripheral Clocks Enable **/
#define RCC_C1_AHB1ENR_USB1OTGEN		(1 << 25)
/** RCC_C1_AHB1ENR_ETH1RXEN Ethernet Reception Clock Enable **/
#define RCC_C1_AHB1ENR_ETH1RXEN		(1 << 17)
/** RCC_C1_AHB1ENR_ETH1TXEN Ethernet Transmission Clock Enable **/
#define RCC_C1_AHB1ENR_ETH1TXEN		(1 << 16)
/** RCC_C1_AHB1ENR_ETH1MACEN Ethernet MAC bus interface Clock Enable **/
#define RCC_C1_AHB1ENR_ETH1MACEN		(1 << 15)
/** RCC_C1_AHB1ENR_ADC12EN ADC1/2 Peripheral Clocks Enable **/
#define RCC_C1_AHB1ENR_ADC12EN		(1 << 5)
/** RCC_C1_AHB1ENR_DMA2EN DMA2 Clock Enable **/
#define RCC_C1_AHB1ENR_DMA2EN		(1 << 1)
/** RCC_C1_AHB1ENR_DMA1EN DMA1 Clock Enable **/
#define RCC_C1_AHB1ENR_DMA1EN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_ahb2enr C1AHB2ENR RCC AHB2 Clock Register
@{*/

/** RCC_C1_AHB2ENR_SRAM3EN SRAM3 block enable **/
#define RCC_C1_AHB2ENR_SRAM3EN		(1 << 31)
/** RCC_C1_AHB2ENR_SRAM2EN SRAM2 block enable **/
#define RCC_C1_AHB2ENR_SRAM2EN		(1 << 30)
/** RCC_C1_AHB2ENR_SRAM1EN SRAM1 block enable **/
#define RCC_C1_AHB2ENR_SRAM1EN		(1 << 29)
/** RCC_C1_AHB2ENR_SDMMC2EN SDMMC2 and SDMMC2 delay clock enable **/
#define RCC_C1_AHB2ENR_SDMMC2EN		(1 << 9)
/** RCC_C1_AHB2ENR_RNGEN RNG peripheral clocks enable **/
#define RCC_C1_AHB2ENR_RNGEN		(1 << 6)
/** RCC_C1_AHB2ENR_HASHEN HASH peripheral clock enable **/
#define RCC_C1_AHB2ENR_HASHEN		(1 << 5)
/** RCC_C1_AHB2ENR_CRYPTEN CRYPT peripheral clock enable **/
#define RCC_C1_AHB2ENR_CRYPTEN		(1 << 4)
/** RCC_C1_AHB2ENR_CAMITFEN CAMITF peripheral clock enable **/
#define RCC_C1_AHB2ENR_CAMITFEN		(1 << 0)

/**@}*/

/** @defgroup rcc_c1_ahb4enr C1AHB4ENR RCC AHB4 Clock Register
@{*/

